<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

return array(
	"E10001"=>"请求参数格式不正确!",	
	"E10002"=>"请求参数体格式不正确!",
	"E10003"=>"交易码不能为空!",
	"E10004"=>"请求方系统代码不能为空!",
	"E10005"=>"目标系统代码不能为空!",
	"E10006"=>"无效的交易码",
	"E00001"=>"错误！",
	
		
	
	/*
	 | -------------------------------------------------------------------
	 | 商品业务接口错误
	 | -------------------------------------------------------------------
	*/
	"SHMEG0001"=>"商品新增错误！",	
	"SHMEG0002"=>"sku_id不能为空",
	"SHMEG0003"=>"商品更改失败",
	"SHMEG0004"=>"商品删除失败",	
	/*
	 | -------------------------------------------------------------------
	 | 服务商业务接口错误
	 | -------------------------------------------------------------------
	 */
	"SHMEE0001"=>"新增失败！",
		
	"E50001"=>"接口类不存在！",
);